package com.yundao.bs.enums;

/**
 * 梦网编码枚举
 *
 * @author jan
 * @create 2017-06-17 PM3:18
 **/
public enum MontnetsEnum {

    /**
     * 成功
     */
    CODE_0(0),

    /**
     * 参数为空。信息、电话号码等有空指针，登陆失败
     */
    CODE__1(-1),

    /**
     * 有异常电话号码
     */
    CODE__12(-12),

    /**
     * 实际号码个数超过100
     */
    CODE__14(-14),

    /**
     * 服务器内部错误
     */
    CODE__999(-999),

    /**
     * 参数有误
     */
    CODE__1002(-1002),

    /**
     * 用户登陆不成功(帐号不存在/停用/密码错误)
     */
    CODE__10001(-10001),

    /**
     * 用户余额不足
     */
    CODE__10003(-10003),

    /**
     * 信息内容超长
     */
    CODE__10011(-10011),

    /**
     * 此用户没有权限从此通道发送信息(用户没有绑定该性质的通道，比如：用户发了小灵通的号码)
     */
    CODE__10029(-10029),

    /**
     * 不能发送移动号码
     */
    CODE__10030(-10030),

    /**
     * 手机号码(段)非法
     */
    CODE__10031(-10031),

    /**
     * 连接数超限
     */
    CODE__10056(-10056),

    /**
     * IP受限
     */
    CODE__10057(-10057);

    private int key;

    MontnetsEnum(int key) {
        this.key = key;
    }

    public int getKey() {
        return key;
    }
}
